processor/src/web/web/WEB-INF/classes/META-INF/rnip/SmevUnifoService.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<wsdl:definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:unifo="http://roskazna.ru/gisgmp/02000000/SmevGISGMPService/" name="SmevGISGMPService" targetNamespace="http://roskazna.ru/gisgmp/02000000/SmevGISGMPService/">
	<wsdl:types>
		<xsd:schema targetNamespace="http://roskazna.ru/gisgmp/02000000/SmevGISGMPService/" xmlns:smev="http://smev.gosuslugi.ru/rev120315">
			<xsd:import schemaLocation="request/smev.unifo.rev120315.xsd" namespace="http://smev.gosuslugi.ru/rev120315"/>
			<xsd:import schemaLocation="request/Message.xsd" namespace="http://roskazna.ru/gisgmp/xsd/116/Message"/>
			<xsd:import schemaLocation="request/MessageData.xsd" namespace="http://roskazna.ru/gisgmp/xsd/116/MessageData"/>
			<xsd:import schemaLocation="request/DataRequest.xsd" namespace="http://roskazna.ru/gisgmp/xsd/116/PGU_DataRequest"/>
			<xsd:import schemaLocation="entity/document/Catalog.xsd" namespace="http://roskazna.ru/gisgmp/xsd/116/Catalog"/>
			<xsd:import schemaLocation="entity/document/Payment.xsd" namespace="http://roskazna.ru/gisgmp/xsd/116/PaymentInfo"/>
			<xsd:import schemaLocation="entity/document/Charge.xsd" namespace="http://roskazna.ru/gisgmp/xsd/116/Charge"/>
			<xsd:import schemaLocation="entity/document/Income.xsd" namespace="http://roskazna.ru/gisgmp/xsd/116/Income"/>
			<xsd:import schemaLocation="entity/document/Quittance.xsd" namespace="http://roskazna.ru/gisgmp/xsd/116/Quittance"/>
			<xsd:import schemaLocation="entity/directory/BudgetIndex.xsd" namespace="http://roskazna.ru/gisgmp/xsd/116/BudgetIndex"/>
			<xsd:import schemaLocation="entity/directory/Common.xsd" namespace="http://roskazna.ru/gisgmp/xsd/116/Common"/>
			<xsd:import schemaLocation="entity/directory/ErrInfo.xsd" namespace="http://roskazna.ru/gisgmp/xsd/116/ErrInfo"/>
			<xsd:import schemaLocation="entity/directory/Organization.xsd" namespace="http://roskazna.ru/gisgmp/xsd/116/Organization"/>
			<xsd:element name="GISGMPTransferMsg" type="smev:BaseMessageType"/>
		</xsd:schema>
	</wsdl:types>
	<wsdl:message name="GISGMPTransferMsgRequest">
		<wsdl:part name="inputmsg" element="unifo:GISGMPTransferMsg"/>
	</wsdl:message>
	<wsdl:message name="GISGMPTransferMsgResponse">
		<wsdl:part name="outputmsg" element="unifo:GISGMPTransferMsg"/>
	</wsdl:message>
	<wsdl:portType name="SmevGISGMPService">
		<wsdl:operation name="GISGMPTransferMsg">
			<wsdl:input message="unifo:GISGMPTransferMsgRequest"/>
			<wsdl:output message="unifo:GISGMPTransferMsgResponse"/>
		</wsdl:operation>
	</wsdl:portType>
	<wsdl:binding name="SmevGISGMPServiceSOAP" type="unifo:SmevGISGMPService">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsdl:operation name="GISGMPTransferMsg">
			<soap:operation soapAction="http://roskazna.ru/gisgmp/02000000/SmevGISGMPService/GISGMPTransferMsg"/>
			<wsdl:input>
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>
	<wsdl:service name="SmevGISGMPService">
		<wsdl:port name="SmevGISGMPServiceSOAP" binding="unifo:SmevGISGMPServiceSOAP">
			<soap:address location="http://roskazna.ru/gisgmp/02000000/"/>
		</wsdl:port>
	</wsdl:service>
</wsdl:definitions>
