processor/src/web/web/WEB-INF/classes/META-INF/rnip/createCatalog_v116.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
<soapenv:Header>
<wsse:Security soapenv:actor="http://smev.gosuslugi.ru/actors/smev">
	<wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="SenderCertificate"/>
</wsse:Security>
</soapenv:Header>
<soapenv:Body wsu:Id="body">
<n1:GISGMPTransferMsg xmlns:gisgmp="http://roskazna.ru/gisgmp/xsd/116/Message" xmlns:msgd="http://roskazna.ru/gisgmp/xsd/116/MessageData" xmlns:n1="http://roskazna.ru/gisgmp/02000000/SmevGISGMPService/" xmlns:smev="http://smev.gosuslugi.ru/rev120315">
			<smev:Message>
				<smev:Sender>
					<smev:Code>ISPP00000</smev:Code>
					<smev:Name>ИС ПП</smev:Name>
				</smev:Sender>
				<smev:Recipient>
					<smev:Code>000009500</smev:Code>
					<smev:Name>RNIP</smev:Name>
				</smev:Recipient>
				<smev:ServiceName>0</smev:ServiceName>
				<smev:TypeCode>GSRV</smev:TypeCode>
				<smev:Status>REQUEST</smev:Status>
				<smev:Date>%CURRENT_DATE_TIME%</smev:Date>
				<smev:ExchangeType>6</smev:ExchangeType>
			</smev:Message>
			<smev:MessageData>
				<smev:AppData>
					<gisgmp:RequestMessage Id="N_4a0d84ca-1fc6-11e5-99c3-bcaec5d977ce" timestamp="%CURRENT_DATE_TIME%" senderIdentifier="%CONTRAGENT_ID%">
						<ImportCatalogRequest xmlns="http://roskazna.ru/gisgmp/xsd/116/MessageData">
							<ServiceCatalog xmlns:ns1="http://roskazna.ru/gisgmp/xsd/116/Catalog" xmlns:ns2="http://roskazna.ru/gisgmp/xsd/116/Common" xmlns:org="http://roskazna.ru/gisgmp/xsd/116/Organization" Id="N_52d85fa5-18ae-11e5-b50b-bcaec5d977ce" name="Изменение" revisionDate="%CURRENT_DATE%">
								<ns1:Service name="Услуга питания в ОУ" code="AAAAA%CONTRAGENT_ID%0000000001" desc="Услуги по оплате питания учеников в образовательных учреждениях" isActive="true" revisionDate="%CURRENT_DATE%">
									<ns1:ServiceCategory code="PIP0000019" name="Недоступно для оплаты"/>
									<ns1:PaymentParameters>
										<ns1:DescriptionSimpleParameter forPayment="true" forSearch="false" label="Код гос. услуги" name="SRV_CODE" readonly="true" required="true" visible="false">
											<ns1:DefaultValue>AAAAA%CONTRAGENT_ID%0000000001</ns1:DefaultValue>
										</ns1:DescriptionSimpleParameter>
										<ns1:DescriptionSimpleParameter label="Номер договора" isId="1" name="PAYMENT_TO" required="true" visible="true" readonly="false" forSearch="true" forPayment="true">
											<ns1:Regexp>^\d{6,15}$</ns1:Regexp>
										</ns1:DescriptionSimpleParameter>
										<ns1:DescriptionSimpleParameter forPayment="true" forSearch="false" label="Идентификатор поставщика" name="PAYMENT" readonly="true" required="true" visible="false">
											<ns1:DefaultValue>%CONTRAGENT_BMID%</ns1:DefaultValue>
										</ns1:DescriptionSimpleParameter>
										<ns1:DescriptionSimpleParameter name="STATUS" label="Статус плательщика" required="true" readonly="false" visible="false" forSearch="false" forPayment="true">
											<ns1:DefaultValue>0</ns1:DefaultValue>
										</ns1:DescriptionSimpleParameter>
										<ns1:DescriptionSimpleParameter name="PAYMENTTYPE " label="Тип платежа" required="true" readonly="false" visible="false" forSearch="false" forPayment="true">
											<ns1:DefaultValue>0</ns1:DefaultValue>
										</ns1:DescriptionSimpleParameter>
										<ns1:DescriptionSimpleParameter name="PURPOSE" label="Основание платежа" required="true" readonly="false" visible="false" forSearch="false" forPayment="true">
											<ns1:DefaultValue>0</ns1:DefaultValue>
										</ns1:DescriptionSimpleParameter>
										<ns1:DescriptionSimpleParameter name="TAXPERIOD" label="Налоговый период" required="true" readonly="false" visible="false" forSearch="false" forPayment="true">
											<ns1:DefaultValue>0</ns1:DefaultValue>
										</ns1:DescriptionSimpleParameter>
										<ns1:DescriptionSimpleParameter name="TAXDOCNUMBER" label="Показатель номера документа" required="true" readonly="false" visible="false" forSearch="false" forPayment="true">
											<ns1:DefaultValue>0</ns1:DefaultValue>
										</ns1:DescriptionSimpleParameter>
										<ns1:DescriptionSimpleParameter name="TAXDOCDATE" label="Показатель даты документа" required="true" readonly="false" visible="false" forSearch="false" forPayment="true">
											<ns1:DefaultValue>0</ns1:DefaultValue>
										</ns1:DescriptionSimpleParameter>
										<ns1:DescriptionSimpleParameter label="Код бюджетной классификации" name="KBK" required="true" visible="false" readonly="true" forPayment="true" forSearch="false">
											<ns1:DefaultValue>%KBK%</ns1:DefaultValue>
										</ns1:DescriptionSimpleParameter>
										<ns1:DescriptionSimpleParameter forPayment="true" forSearch="false" label="Наименование получателя" name="Recipient" readonly="true" required="true" visible="true">
											<ns1:DefaultValue>%CONTRAGENT_NAME%</ns1:DefaultValue>
										</ns1:DescriptionSimpleParameter>
										<ns1:DescriptionSimpleParameter forPayment="true" forSearch="false" label="Назначение платежа" name="Narrative" readonly="false" required="true" visible="true">
											<ns1:DefaultValue>Оплата услуг питания в образовательном учреждении</ns1:DefaultValue>
										</ns1:DescriptionSimpleParameter>
									</ns1:PaymentParameters>
									<ns1:CurrenciesServices>
										<ns1:CurrencyCode>RUR</ns1:CurrencyCode>
									</ns1:CurrenciesServices>
									<org:Payee name="%CONTRAGENT_NAME%" INN="%INN%" KPP="%KPP%" OKTMO="%OKTMO%" OGRN="%OGRN%">
										<org:Accounts>
											<org:Account kind="1">
												<org:Account>%FINANCE_ACCOUNT%</org:Account>
												<org:Bank>
													<org:Name>%FINANCE_PROVIDER%</org:Name>
													<org:BIK>%BIK%</org:BIK>
													<org:CorrespondentBankAccount>%KORR_FINANCE_ACCOUNT%</org:CorrespondentBankAccount>
												</org:Bank>
											</org:Account>
										</org:Accounts>
									</org:Payee>
									<ns1:PaymentKind>1</ns1:PaymentKind>
									<ns1:MinAmount currency="RUR" exponent="2">1</ns1:MinAmount>
									<ns1:MaxAmount currency="RUR" exponent="2">2147483647</ns1:MaxAmount>
									<ns1:Commissions>
										<ns2:Comission>
											<ns2:Kind>4</ns2:Kind>
											<ns2:Percent>%COMISSION_PERCENTS%</ns2:Percent>
											<ns2:MinValue currency="RUR" exponent="2">1</ns2:MinValue>
											<ns2:MaxValue currency="RUR" exponent="2">2147483647</ns2:MaxValue>
										</ns2:Comission>
									</ns1:Commissions>
								</ns1:Service>
							</ServiceCatalog>
						</ImportCatalogRequest>
					</gisgmp:RequestMessage>
				</smev:AppData>
			</smev:MessageData>
		</n1:GISGMPTransferMsg>
	</soapenv:Body>
</soapenv:Envelope>