xml4test/1637006.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:rev="http://smev.gosuslugi.ru/rev120315" xmlns:smev="http://roskazna.ru/gisgmp/02000000/SmevGISGMPService/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><soapenv:Header><wsse:Security soapenv:actor="http://smev.gosuslugi.ru/actors/smev"><ds:Signature><ds:KeyInfo><wsse:SecurityTokenReference><wsse:Reference URI="#SenderCertificate"/></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="SenderCertificate"/></wsse:Security></soapenv:Header><soapenv:Body wsu:Id="251CFF84-4583-40E0-88AD-DBCD1B6BC0CF"><smev:GISGMPTransferMsg><rev:Message><rev:Sender><rev:Code>981601301</rev:Code><rev:Name>АО ВКАБАНК</rev:Name></rev:Sender><rev:Recipient><rev:Code>RKZN35001</rev:Code><rev:Name>Казначейство России</rev:Name></rev:Recipient><rev:Originator><rev:Code>981601301</rev:Code><rev:Name>АО ВКАБАНК</rev:Name></rev:Originator><rev:ServiceName>GISGMP</rev:ServiceName><rev:TypeCode>GFNC</rev:TypeCode><rev:Status>REQUEST</rev:Status><rev:Date>2018-07-30T10:03:55.2482921+04:00</rev:Date><rev:ExchangeType>6</rev:ExchangeType></rev:Message><rev:MessageData><rev:AppData xmlns:rev="http://smev.gosuslugi.ru/rev120315" xmlns:gisgmp="http://roskazna.ru/gisgmp/xsd/116/Message"><gisgmp:RequestMessage timestamp="2018-07-30T10:03:55.2482921+04:00" senderIdentifier="3637c9" Id="A_251CFF84-4583-40E0-88AD-DBCD1B6BC0CF" senderRole="7"><msgd:ImportRequest xmlns:msgd="http://roskazna.ru/gisgmp/xsd/116/MessageData"><pir:Package xmlns:pir="http://roskazna.ru/gisgmp/xsd/116/PGU_ImportRequest"><pir:Document><pi:FinalPayment xmlns:pi="http://roskazna.ru/gisgmp/xsd/116/PaymentInfo" xmlns:bdi="http://roskazna.ru/gisgmp/xsd/116/BudgetIndex" xmlns:com="http://roskazna.ru/gisgmp/xsd/116/Common" xmlns:org="http://roskazna.ru/gisgmp/xsd/116/Organization" Id="W_4AABC6A6-AB8F-4E64-B115-DDE9786503F2"><pi:SupplierBillID>0</pi:SupplierBillID><pi:Narrative>Налог на имущество организаций за 2 квартал 2018 года</pi:Narrative><pi:Amount>1085500</pi:Amount><pi:PaymentDate>2018-07-30</pi:PaymentDate><pi:ReceiptDate>2018-07-27</pi:ReceiptDate><pi:BudgetIndex><bdi:Status>01</bdi:Status><bdi:Purpose>ТП</bdi:Purpose><bdi:TaxPeriod>КВ.02.2018</bdi:TaxPeriod><bdi:TaxDocNumber>0</bdi:TaxDocNumber><bdi:TaxDocDate>0</bdi:TaxDocDate></pi:BudgetIndex><pi:PaymentIdentificationData><pi:Bank><org:Name>АО ВКАБАНК</org:Name><org:BIK>041203729</org:BIK><org:CorrespondentBankAccount>30101810700000000729</org:CorrespondentBankAccount></pi:Bank><pi:SystemIdentifier>10412037290000003007201843945789</pi:SystemIdentifier></pi:PaymentIdentificationData><pi:AccDoc><pi:AccDocNo>495</pi:AccDocNo><pi:AccDocDate>2018-07-27</pi:AccDocDate></pi:AccDoc><pi:Payer><com:PayerIdentifier>23017031965301901001</com:PayerIdentifier><pi:PayerName>ООО "ТЕПЛО"</pi:PayerName><pi:PayerAccount>40702810800030000429</pi:PayerAccount></pi:Payer><pi:Payee><pi:PayeeName>Управление Федерального казначейства по Астраханской области (Межрайонная ИФНС России № 1 по Астраханской области)</pi:PayeeName><pi:payeeINN>3006006822</pi:payeeINN><pi:payeeKPP>300601001</pi:payeeKPP><pi:PayeeBankAcc><org:AccountNumber>40101810400000010009</org:AccountNumber><org:Bank><org:BIK>041203001</org:BIK></org:Bank></pi:PayeeBankAcc></pi:Payee><pi:RecipientServicesIdentifier>0</pi:RecipientServicesIdentifier><pi:ChangeStatus meaning="1"/><pi:KBK>18210602010021000110</pi:KBK><com:TransKind>01</com:TransKind><pi:Priority>5</pi:Priority><pi:OKTMO>12701000</pi:OKTMO><com:AdditionalData><com:Name>Наименование банка получателя</com:Name><com:Value>ОТДЕЛЕНИЕ АСТРАХАНЬ г. Астрахань</com:Value></com:AdditionalData></pi:FinalPayment></pir:Document></pir:Package></msgd:ImportRequest></gisgmp:RequestMessage></rev:AppData></rev:MessageData></smev:GISGMPTransferMsg></soapenv:Body></soapenv:Envelope>