xml4test/1637006.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:rev="http://smev.gosuslugi.ru/rev120315" xmlns:smev="http://roskazna.ru/gisgmp/02000000/SmevGISGMPService/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><soapenv:Header><wsse:Security soapenv:actor="http://smev.gosuslugi.ru/actors/smev"><ds:Signature><ds:KeyInfo><wsse:SecurityTokenReference><wsse:Reference URI="#SenderCertificate"/></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="SenderCertificate"/></wsse:Security></soapenv:Header><soapenv:Body wsu:Id="W_A9CE6C4D-EBAC-45AF-AC64-987C4674464E"><smev:GISGMPTransferMsg><rev:Message><rev:Sender><rev:Code>981601301</rev:Code><rev:Name>АО ВКАБАНК</rev:Name></rev:Sender><rev:Recipient><rev:Code>RKZN35001</rev:Code><rev:Name>Казначейство России</rev:Name></rev:Recipient><rev:Originator><rev:Code>981601301</rev:Code><rev:Name>АО ВКАБАНК</rev:Name></rev:Originator><rev:ServiceName>GISGMP</rev:ServiceName><rev:TypeCode>GFNC</rev:TypeCode><rev:Status>REQUEST</rev:Status><rev:Date>2018-07-03T08:50:02.7396645+04:00</rev:Date><rev:ExchangeType>6</rev:ExchangeType></rev:Message><rev:MessageData><rev:AppData xmlns:rev="http://smev.gosuslugi.ru/rev120315" xmlns:gisgmp="http://roskazna.ru/gisgmp/xsd/116/Message"><gisgmp:RequestMessage timestamp="2018-07-03T08:50:02.7396645+04:00" senderIdentifier="3637c9" Id="A_W_A9CE6C4D-EBAC-45AF-AC64-987C4674464E" senderRole="7"><msgd:ExportRequest xmlns:pdr="http://roskazna.ru/gisgmp/xsd/116/PGU_DataRequest" xmlns:msgd="http://roskazna.ru/gisgmp/xsd/116/MessageData" kind="CHARGE" Id="ID58DE01D8-2AF1-40DF-9B13-57296BC8BDC0"><pdr:Filter><pdr:Conditions><pdr:ChargesIdentifiers xmlns:pdr="http://roskazna.ru/gisgmp/xsd/116/PGU_DataRequest"><pdr:SupplierBillID>18810130180530026321</pdr:SupplierBillID></pdr:ChargesIdentifiers></pdr:Conditions></pdr:Filter></msgd:ExportRequest></gisgmp:RequestMessage></rev:AppData></rev:MessageData></smev:GISGMPTransferMsg></soapenv:Body></soapenv:Envelope>